Repository: typestack/class-validator
Catalog: i18n/*.po
Languages: tr

source: $IS_INSTANCE decorator expects and object as value, but got falsy value.
tr: $IS_INSTANCE dekoratör bir nesne değer olmasını bekler, ancak yanlış değer atanmış

source: $property is $constraint1
tr: $property $constraint1 'dir

source: $property is not a valid decimal number.
tr: $property geçerli bir ondalık sayı değil

source: $property must be a BIC or SWIFT code
tr: $property BIC veya SWIFT kodu olmalıdır

source: $property must be a boolean string
tr: $property bir doğru veya yanlış dizesi olmalıdır

source: $property must be a boolean value
tr: $property doğru veya yanlış değeri olmalıdır

source: $property must be a BTC address
tr: $property bir BTC adres olmalıdır

source: $property must be a credit card
tr: $property bir kredi kartı olmalıdır

source: $property must be a currency
tr: $property bir para birimi olmalı

source: $property must be a data uri format
tr: $property bir uri formatı olmalı

source: $property must be a Date instance
tr: $property bir tarih örneği olmalıdır

source: $property must be a Firebase Push Id
tr: $property bir Firebase Push Id olmalıdır

source: $property must be a hash of type $constraint1
tr: $property $constraint1 türünde bir karma değer olmalıdır

source: $property must be a hexadecimal color
tr: $property bir onaltılık renk olmalıdır

source: $property must be a hexadecimal number
tr: $property bir onaltılık bir sayı olmalıdır

source: $property must be a HSL color
tr: $property bir HSL renk olmalıdır

source: $property must be a identity card number
tr: $property bir kimlik kart numarası olmalıdır

source: $property must be a ISSN
tr: $property bir ISSN olmalıdır

source: $property must be a json string
tr: $property bir json dizesi olmalıdır

source: $property must be a jwt string
tr: $property bir jwt dizesi olmalıdır

source: $property must be a latitude string or number
tr: $property bir enlem dizesi veya sayı olmalıdır

source: $property must be a latitude,longitude string
tr: $property bir enlem boylam dizesi olmalıdır

source: $property must be a longitude string or number
tr: $property boylam dizesi veya sayı olmalıdır

source: $property must be a lowercase string
tr: $property bir küçük harf dizesi olmalı

source: $property must be a MAC Address
tr: $property bir MAC Adres olmalıdır

source: $property must be a mongodb id
tr: $property bir mangodb id olmalıdır

source: $property must be a negative number
tr: $property bir negatif sayı olmalıdır

source: $property must be a non-empty object
tr: $property boş olmayan bir nesne olmalıdır

source: $property must be a number conforming to the specified constraints
tr: $property belirtilen kısıtlamalara uyan sayı olmalıdır

source: $property must be a number string
tr: $property bir sayı dizesi olmalıdır

source: $property must be a phone number
tr: $property bir telefon numarası olmalıdır

source: $property must be a port
tr: $property bir port olmalıdır

source: $property must be a positive number
tr: $property bir pozitif sayı olmalıdır

source: $property must be a postal code
tr: $property bir posta kodu olmalıdır

source: $property must be a Semantic Versioning Specification
tr: $property bir anlamsal sürüm oluşturma belirtimi olmalıdır

source: $property must be a string
tr: $property bir dizi olmalıdır

source: $property must be a valid domain name
tr: $property geçerli bir domain adı olmalıdır

source: $property must be a valid enum value
tr: $property geçerli bir enum değeri olmalı

source: $property must be a valid ISO 8601 date string
tr: $property geçerli bir ISO 8601 tarih dizesi olmalıdır

source: $property must be a valid ISO31661 Alpha2 code
tr: $property geçerli bir ISO31661 Alpha2 kodu olmalıdır

source: $property must be a valid ISO31661 Alpha3 code
tr: geçerli bir ISO31661 Alpha3 kodu olmalıdır

source: $property must be a valid phone number
tr: $property geçerli bir telefon numarası olmalıdır

source: $property must be a valid representation of military time in the format HH:MM
tr: $property geçerli bir SS:DD format şeklinde olmalıdır

source: $property must be an array
tr: $property geçerli bir dizi olmalıdır

source: $property must be an EAN (European Article Number)
tr: $property geçerli bir EAN kodu olmalıdır

source: $property must be an email
tr: $property bir e-posta olmalıdır

source: $property must be an Ethereum address
tr: $property geçerli bir Ethereum adres olmalıdır

source: $property must be an IBAN
tr: $property geçerli bir IBAN olmalıdır

source: $property must be an instance of $constraint1name
tr: $property $constraint1name özelliğinde olmalıdır

source: $property must be an integer number
tr: $property geçerli bir tam sayı olmalıdır

source: $property must be an ip address
tr: $property geçerli bir ip adresi olmalıdır

source: $property must be an ISBN
tr: $property geçerli bir ISBN adresi olmalıdır

source: $property must be an ISIN (stock/security identifier)
tr: $property geçerli bir ISIN olmalıdır

source: $property must be an ISRC
tr: $property geçerli bir ISRC olmalıdır

source: $property must be an object
tr: $property geçerli bir nesne olmalıdır

source: $property must be an URL address
tr: $property geçerli bir URL adres olmalıdır

source: $property must be a UUID
tr: $property geçerli bir UUID olmalıdır

source: $property must be base32 encoded
tr: $property geçerli bir base32 kodlanmış olmalıdır

source: $property must be base64 encoded
tr: $property geçerli bir base64 kodlanmış olmalıdır

source: $property must be divisible by $constraint1
tr: $property değer $constraint1 ile bölünebilir olmalıdır

source: $property must be empty
tr: $property boş olmalıdır

source: $property must be equal to $constraint1
tr: $property değer $constraint1'e eşit olmalıdır

source: $property must be locale
tr: $property yerel olmalıdır

source: $property must be longer than or equal to $constraint1 and shorter than or equal to $constraint2 characters
tr: $property $constraint1'den uzun veya $constraint2 karakterinden kısa yada ona eşit olmalıdır

source: $property must be longer than or equal to $constraint1 characters
tr: $property $constraint1 karakterinden uzun veya eşit olmalıdır

source: $property must be magnet uri format
tr: $property bir mıknatıs uri formatında olmalıdır

source: $property must be MIME type format
tr: $property bir MIME tür biçiminde olmalıdır

source: $property must be one of the following values: $constraint1
tr: $property şu $constraint1 değerlerden biri olmalıdır

source: $property must be RFC 3339 date
tr: $property RFC 3339 tarihi olmalıdır

source: $property must be RGB color
tr: $property bir RGB renk biçimi olmalıdır

source: $property must be shorter than or equal to $constraint1 characters
tr: $property $constraint1 karakterinden kısa veya ona eşit olmalıdır

source: $property must be shorter than or equal to $constraint2 characters
tr: $property $constraint2 karakterinden kısa veya ona eşit olmalıdır

source: $property must be uppercase
tr: $property bir büyük harf olmalıdır

source: $property must be valid octal number
tr: $property geçerli sekiz sayı olmalıdır

source: $property must be valid passport number
tr: $property geçerli bir pasaport numarası olmalıdır

source: $property must contain $constraint1 values
tr: $property $constraint1 değerini içermelidir

source: $property must contain a $constraint1 string
tr: $property değeri $constraint1 içeren dize olmalıdır

source: $property must contain a full-width and half-width characters
tr: $property tam genişlik veya yarım genişlikte karakterler içermelidir

source: $property must contain a full-width characters
tr: $property tam genişlikte karakterler içermelidir

source: $property must contain a half-width characters
tr: $property yarım genişliğinde karakterler içermelidir

source: $property must contain any surrogate pairs chars
tr: $property herhangi bir vekil çift karakter içermelidir

source: $property must contain at least $constraint1 elements
tr: $property en az $constraint1 öğe içermelidir

source: $property must contain not more than $constraint1 elements
tr: $property $constraint1'den fazla öğe içermemelidir

source: $property must contain one or more multibyte chars
tr: $property birden fazla veya daha çok baytlı karakter içermelidir

source: $property must contain only ASCII characters
tr: $property sadece ASCII karakterler içermelidir

source: $property must contain only letters (a-zA-Z)
tr: $property sadece harf içermelidir (a-z, A-Z)

source: $property must contain only letters and numbers
tr: $property sadece harf ve rakamlardan oluşmalıdır

source: $property must match $constraint1 regular expression
tr: $property $constraint1 normal ifadesiyle eşleşmelidir

source: $property must not be greater than $constraint1
tr: $property $constraint1 değerinden büyük olmalıdır

source: $property must not be less than $constraint1
tr: $property $constraint1 değerinden küçük olmalıdır

source: $property should not be empty
tr: $property boş olmamalıdır

source: $property should not be equal to $constraint1
tr: $property $constraint1 eşit olmamalıdır

source: $property should not be null or undefined
tr: $property boş veya tanımsız olmamalıdır

source: $property should not be one of the following values: $constraint1
tr: $property şu değerinden $constraint1 biri olmalıdır

source: $property should not contain $constraint1 values
tr: $property şu değeri $constraint1 içermemelidir

source: $property should not contain a $constraint1 string
tr: $property bir $constraint1 dizesi içermemelidir

source: $property's byte length must fall into ($constraint1, $constraint2) range
tr: $property bayt uzunluğu ($constraint1, $constraint2) aralığına denk gelmelidir

source: All $property's elements must be unique
tr: $property tüm öğeleri benzersiz olmalıdır

source: each value in
tr: her değer

source: maximal allowed date for
tr: için verilen maksimum tarih

source: minimal allowed date for
tr: minimum izin verilen tarih

source: nested property $property must be either object or array
tr: yuvalanmış $property özelliği, nesne veya Context dizisi olmalıdır
